; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_2 ?v3 - type_2 ?v1 - type_1)
 	      (pred_3 ?v2 - object ?v1 - type_1)
	      (pred_4 ?v3 - type_2 ?v5 - type_3)
	      (pred_1 ?v3 - type_2 ?v2 - object ?v5 - type_3))

   (:action op_3
       :parameters  (?v3 - type_2 ?v8 ?v7 - type_1)
       :precondition (and  (pred_2 ?v3 ?v8))
       :effect (and  (pred_2 ?v3 ?v7)
		     (not (pred_2 ?v3 ?v8))))

   (:action op_1
       :parameters (?v3 - type_2 ?v4 - object ?v6 - type_1 ?v5 - type_3)
       :precondition  (and  (pred_3 ?v4 ?v6) (pred_2 ?v3 ?v6) (pred_4 ?v3 ?v5))
       :effect (and (pred_1 ?v3 ?v4 ?v5)
		    (not (pred_3 ?v4 ?v6)) 
		    (not (pred_4 ?v3 ?v5))))

   (:action op_2
       :parameters (?v3 - type_2 ?v4 - object ?v6 - type_1 ?v5 - type_3)
       :precondition  (and  (pred_1 ?v3 ?v4 ?v5) (pred_2 ?v3 ?v6))
       :effect (and (pred_3 ?v4 ?v6)
		    (pred_4 ?v3 ?v5)
		    (not (pred_1 ?v3 ?v4 ?v5)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_08 obj_01 - type_2
obj_02 obj_09 obj_03 obj_05 - type_3
obj_07 obj_04 obj_10 obj_13 - type_1
obj_06 obj_11 obj_12 - object)
(:init
(pred_2 obj_08 obj_10)
(pred_4 obj_08 obj_02)
(pred_4 obj_08 obj_09)
(pred_2 obj_01 obj_07)
(pred_4 obj_01 obj_03)
(pred_4 obj_01 obj_05)
(pred_3 obj_06 obj_10)
(pred_3 obj_11 obj_13)
(pred_3 obj_12 obj_04)
)
(:goal
(and
(pred_3 obj_06 obj_13)
(pred_3 obj_11 obj_07)
(pred_3 obj_12 obj_13)
)
)

(:constraints
  (always (not (pred_2 obj_08 obj_13)))
)
)

; plan
1. (op_1 obj_08 obj_06 obj_10 obj_09)
   deleted: (pred_3 obj_06 obj_10) (pred_4 obj_08 obj_09)
   added: (pred_1 obj_08 obj_06 obj_09)
   goals met: 0 of 3
2. (op_3 obj_01 obj_07 obj_13)
   deleted: (pred_2 obj_01 obj_07)
   added: (pred_2 obj_01 obj_13)
   goals met: 0 of 3
3. (op_3 obj_08 obj_10 obj_04)
   deleted: (pred_2 obj_08 obj_10)
   added: (pred_2 obj_08 obj_04)
   goals met: 0 of 3
4. (op_1 obj_01 obj_11 obj_13 obj_05)
   deleted: (pred_3 obj_11 obj_13) (pred_4 obj_01 obj_05)
   added: (pred_1 obj_01 obj_11 obj_05)
   goals met: 0 of 3
5. (op_1 obj_08 obj_12 obj_04 obj_02)
   deleted: (pred_3 obj_12 obj_04) (pred_4 obj_08 obj_02)
   added: (pred_1 obj_08 obj_12 obj_02)
   goals met: 0 of 3
6. (op_3 obj_01 obj_13 obj_07)
   deleted: (pred_2 obj_01 obj_13)
   added: (pred_2 obj_01 obj_07)
   goals met: 0 of 3
7. (op_2 obj_01 obj_11 obj_07 obj_05)
   deleted: (pred_1 obj_01 obj_11 obj_05)
   added: (pred_3 obj_11 obj_07) (pred_4 obj_01 obj_05)
   goals met: 1 of 3
8. (op_2 obj_08 obj_12 obj_04 obj_02)
   deleted: (pred_1 obj_08 obj_12 obj_02)
   added: (pred_3 obj_12 obj_04) (pred_4 obj_08 obj_02)
   goals met: 1 of 3
9. (op_3 obj_01 obj_07 obj_04)
   deleted: (pred_2 obj_01 obj_07)
   added: (pred_2 obj_01 obj_04)
   goals met: 1 of 3
10. (op_2 obj_08 obj_06 obj_04 obj_09)
   deleted: (pred_1 obj_08 obj_06 obj_09)
   added: (pred_3 obj_06 obj_04) (pred_4 obj_08 obj_09)
   goals met: 1 of 3
11. (op_1 obj_01 obj_06 obj_04 obj_05)
   deleted: (pred_3 obj_06 obj_04) (pred_4 obj_01 obj_05)
   added: (pred_1 obj_01 obj_06 obj_05)
   goals met: 1 of 3
12. (op_3 obj_01 obj_04 obj_13)
   deleted: (pred_2 obj_01 obj_04)
   added: (pred_2 obj_01 obj_13)
   goals met: 1 of 3
13. (op_2 obj_01 obj_06 obj_13 obj_05)
   deleted: (pred_1 obj_01 obj_06 obj_05)
   added: (pred_3 obj_06 obj_13) (pred_4 obj_01 obj_05)
   goals met: 2 of 3
14. (op_3 obj_01 obj_13 obj_04)
   deleted: (pred_2 obj_01 obj_13)
   added: (pred_2 obj_01 obj_04)
   goals met: 2 of 3
15. (op_1 obj_01 obj_12 obj_04 obj_05)
   deleted: (pred_3 obj_12 obj_04) (pred_4 obj_01 obj_05)
   added: (pred_1 obj_01 obj_12 obj_05)
   goals met: 2 of 3
16. (op_3 obj_01 obj_04 obj_13)
   deleted: (pred_2 obj_01 obj_04)
   added: (pred_2 obj_01 obj_13)
   goals met: 2 of 3
17. (op_2 obj_01 obj_12 obj_13 obj_05)
   deleted: (pred_1 obj_01 obj_12 obj_05)
   added: (pred_3 obj_12 obj_13) (pred_4 obj_01 obj_05)
   goals met: 3 of 3
